Reports/упАнализДеятельностиВодителейПоДаннымСТахографов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>упАнализДеятельностиВодителейПоДаннымСТахографов</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/упТахографДанныеОДеятельностиВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упТахографДанныеОДеятельностиВодителей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СлотСчитывающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТахографСлотыСчитывающегоУстройства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТахографСтатусыУправления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоложениеКарточки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТахографПоложенияКарточкиВСчитывающемУстройстве</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТахографРежимыДеятельностиВодителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упФактическиеПараметрыРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упФактическиеПараметрыРейса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоГрузовыхМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НулевойПробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пробег</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнкассации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасстояниеПоДаннымТрекеров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПлановыеПараметрыРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПлановыеПараметрыРейса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОтдыхаВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоГрузовыхМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НулевойПробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Comment>Оценочная стоимость груза</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемоеКоличествоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеНачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеОкончаниеВыполненияИсходное</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнкассации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упТахографРежимыДеятельностиВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТахографРежимыДеятельностиВодителей</Name>
			<Comment>Режимы деятельности водителей </Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вождение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееРабочееВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доступность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдых</Name>
					<Comment>Перерывы и отдых</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/упАнализДеятельностиВодителейПоДаннымСТахографов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	КодЯзыка = ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка();
	УстановитьПараметрыДиаграммыПоУмолчанию(Диаграмма);

	Если Параметры.Свойство("Водитель") Тогда
		
		Водитель = Параметры.Водитель;
		ОбновитьДанные();
		
	КонецЕсли;
	
	ОбновитьШкалу(ЭтаФорма, ВидШкалы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидШкалыПриИзменении(Элемент)
	
	 ОбновитьШкалу(ЭтаФорма, ВидШкалы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновитьДанные(Команда)
	
	ОбновитьДанные();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанные()

	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	дрвДанныеТахогрфа = ПолучитьДанныеТахографа();
	
	Для каждого СтрокаОбщиеИтоги Из дрвДанныеТахогрфа.Строки Цикл
		НачалоПериода	 		= СтрокаОбщиеИтоги.Период;
		ОкончаниеПериода	 	= СтрокаОбщиеИтоги.ПериодОкончание;
		Диаграмма.УстановитьПолныйИнтервал(НачалоДня(НачалоПериода), КонецДня(ОкончаниеПериода));
		Для каждого СтрокаВодитель Из СтрокаОбщиеИтоги.Строки Цикл
			ТекущийВодитель = СтрокаВодитель.Водитель;
			ТочкаВодитель = Диаграмма.УстановитьТочку(ТекущийВодитель);
			ТочкаВодитель.Расшифровка = ТекущийВодитель;
			
			РейсСтроки 		= СтрокаВодитель.Строки;
			КоличествоСтрок = РейсСтроки.Количество();
			Рейс			= Неопределено;
			
			Для каждого СтрокаРейс Из РейсСтроки Цикл
	
				Если НЕ Рейс = СтрокаРейс.Рейс Тогда
					Рейс = СтрокаРейс.Рейс;
					ТочкаРейс = УстановитьТочкуРейса(Диаграмма, Рейс, ТекущийВодитель);
				КонецЕсли;
				
				// Серия.
				сткПараметрыСерии = ХарактеристикиРежимаДеятельностиВодителя(СтрокаРейс.РежимДеятельности);
				СерияДиаграммы = Диаграмма.УстановитьСерию(СтрокаРейс.РежимДеятельности);
				СерияДиаграммы.Цвет = сткПараметрыСерии.Цвет;
				
				// На интервале может быть один рейс:
				//	1. (Рейс1) 		- (НачалоИнтервала, ОкончаниеИнтервала)
				// или два рейса
				// 	2. (Рейс1, Рейс2)  - (НачалоИнтервала, ГраницаРейсов] (ГраницаРейсов + 1, ОкончаниеИнтервала)
				// Где Рейс1, Рейс2 могут быть пустыми
							
				// Начало интервала.
				НачалоИнтервала = СтрокаРейс.Период;
				Рейс1			= СтрокаРейс.Рейс;
				ОкончаниеРейса1	= СтрокаРейс.ОкончаниеРейса;
							
				// Окончание интервала.
				ИндексТекущейСтроки = РейсСтроки.Индекс(СтрокаРейс);
				СтрокаРейс2			= Неопределено;
				Рейс2				= Рейс1;
				Если ИндексТекущейСтроки = КоличествоСтрок - 1 Тогда
					ОкончаниеИнтервала = КонецДня(НачалоИнтервала);
				Иначе	
					СтрокаРейс2			= РейсСтроки.Получить(ИндексТекущейСтроки + 1);
					Рейс2				= СтрокаРейс2.Рейс;
					НачалоРейса2		= СтрокаРейс2.НачалоРейса;
					ОкончаниеИнтервала 	= СтрокаРейс2.Период;
				КонецЕсли;
				 			
				//  Период
				ЗначениеПериод = Диаграмма.ПолучитьЗначение(ТочкаРейс, СерияДиаграммы);
				
				// Если интервал принадлежит одному рейсу
				Если Рейс1 = Рейс2 Тогда
					ДобавитьИнтервал(ЗначениеПериод, НачалоИнтервала, ОкончаниеИнтервала, сткПараметрыСерии.Цвет, сткПараметрыСерии.Текст);
				Иначе	
								
					Если ЗначениеЗаполнено(Рейс1) Тогда
						ГраницаРейсов = ОкончаниеРейса1;			
					Иначе	
						ГраницаРейсов = НачалоРейса2;
					КонецЕсли;
					
					ДобавитьИнтервал(ЗначениеПериод, НачалоИнтервала, ГраницаРейсов, сткПараметрыСерии.Цвет, сткПараметрыСерии.Текст);
					
					ТочкаРейс2 = УстановитьТочкуРейса(Диаграмма, Рейс2, ТекущийВодитель);
											
					ЗначениеПериод = Диаграмма.ПолучитьЗначение(ТочкаРейс2, СерияДиаграммы);
					НачалоИнтервала = ГраницаРейсов + 1;
					ДобавитьИнтервал(ЗначениеПериод, НачалоИнтервала, ОкончаниеИнтервала, сткПараметрыСерии.Цвет, сткПараметрыСерии.Текст);
				КонецЕсли;
			КонецЦикла;
			
			Диаграмма.РазвернутьТочку(ТочкаВодитель, Истина);
		КонецЦикла;
	КонецЦикла;
	
	ВыделитьТекущуюДату(ЭтаФорма);
	
	Диаграмма.Обновление         = Истина;
	
КонецПроцедуры

Функция УстановитьТочкуРейса(Диаграмма, Рейс, Водитель)
	Если ЗначениеЗаполнено(Рейс) Тогда
		ТочкаРейс = Диаграмма.УстановитьТочку(Рейс, Водитель);
		ТочкаРейс.Текст			= Рейс;
		ТочкаРейс.Расшифровка 	= Рейс;
	Иначе	
		ИдентификаторРейса = Нстр("ru = 'БезРейса%1'");
		ИдентификаторРейса = СтрШаблон(ИдентификаторРейса, Водитель);
		ТочкаРейс = Диаграмма.УстановитьТочку(ИдентификаторРейса, Водитель);
		ТочкаРейс.Текст			= Нстр("ru = 'Без рейса'");;
	КонецЕсли;
	
	Возврат ТочкаРейс;
	
КонецФункции

Процедура ДобавитьИнтервал(ЗначениеПериод, НачалоИнтервала, ОкончаниеИнтервала, Цвет, Текст)
	Интервал = ЗначениеПериод.Добавить();
	Интервал.Начало = НачалоИнтервала;
	Интервал.Конец  = ОкончаниеИнтервала;

	Если НачалоДня(НачалоИнтервала) = НачалоДня(ОкончаниеИнтервала) Тогда
		ПериодСтрока = "(" + Формат(НачалоИнтервала, "ДФ=ЧЧ:мм") + " - " 
		+ Формат(ОкончаниеИнтервала, "ДФ=ЧЧ:мм") + ")";
	Иначе	
		
		ПериодСтрока = Формат(НачалоИнтервала, "ДФ='дд.ММ ЧЧ:мм'") + " - "
		+ Формат(ОкончаниеИнтервала, "ДФ='дд.ММ ЧЧ:мм'");
	КонецЕсли; 
	
	Интервал.Цвет = Цвет;
	ТекстИнтервала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ПериодСтрока);
	Интервал.Текст = НСтр(ТекстИнтервала, КодЯзыка);

		
КонецПроцедуры

&НаСервере
Функция ХарактеристикиРежимаДеятельностиВодителя(РежимДеятельности)
	
	сткВозврат = Новый Структура;
	сткВозврат.Вставить("Цвет");
	сткВозврат.Вставить("Текст");
	
	Если РежимДеятельности = Перечисления.упТахографРежимыДеятельностиВодителей.Вождение Тогда
		сткВозврат.Цвет  = WebЦвета.Зеленый;
		сткВозврат.Текст = "ru = 'Вождение %1'";
	ИначеЕсли РежимДеятельности = Перечисления.упТахографРежимыДеятельностиВодителей.Доступность Тогда
		сткВозврат.Цвет  = WebЦвета.Черный;
		сткВозврат.Текст = "ru = 'Доступность %1'";
	ИначеЕсли РежимДеятельности = Перечисления.упТахографРежимыДеятельностиВодителей.Отдых Тогда
		сткВозврат.Цвет  = WebЦвета.Красный;
		сткВозврат.Текст = "ru = 'Отдых %1'";
	ИначеЕсли РежимДеятельности = Перечисления.упТахографРежимыДеятельностиВодителей.ПрочееРабочееВремя Тогда
		сткВозврат.Цвет  = WebЦвета.Желтый;
		сткВозврат.Текст = "ru = 'Прочее рабочее время %1'";
	КонецЕсли;
	
	Возврат сткВозврат;
	
КонецФункции // ОпределитьХарактеристикиСостоянияТС()

#КонецОбласти

#Область Прочее

&НаСервере
Функция ПолучитьДанныеТахографа()

	дрвРезультат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упТахографДанныеОДеятельностиВодителей.Водитель КАК Водитель,
	               |	упТахографДанныеОДеятельностиВодителей.РежимДеятельности,
	               |	упТахографДанныеОДеятельностиВодителей.Период КАК Период,
	               |	упТахографДанныеОДеятельностиВодителей.Период КАК ПериодОкончание,
	               |	ЕСТЬNULL(упФактическиеПараметрыРейса.НачалоВыполнения, упПлановыеПараметрыРейса.ПлановоеНачалоВыполнения) КАК НачалоРейса,
	               |	ВЫБОР
	               |		КОГДА упФактическиеПараметрыРейса.ОкончаниеВыполнения ЕСТЬ NULL
	               |			ТОГДА упПлановыеПараметрыРейса.ПлановоеОкончаниеВыполнения
	               |		КОГДА упФактическиеПараметрыРейса.ОкончаниеВыполнения = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ДОБАВИТЬКДАТЕ(упФактическиеПараметрыРейса.НачалоВыполнения, СЕКУНДА, РАЗНОСТЬДАТ(ЕСТЬNULL(упПлановыеПараметрыРейса.ПлановоеНачалоВыполнения, ДАТАВРЕМЯ(1, 1, 1)), ЕСТЬNULL(упПлановыеПараметрыРейса.ПлановоеОкончаниеВыполнения, ДАТАВРЕМЯ(1, 1, 1)), СЕКУНДА))
	               |		ИНАЧЕ упФактическиеПараметрыРейса.ОкончаниеВыполнения
	               |	КОНЕЦ КАК ОкончаниеРейса,
	               |	упТахографДанныеОДеятельностиВодителей.Рейс
	               |ИЗ
	               |	РегистрСведений.упТахографДанныеОДеятельностиВодителей КАК упТахографДанныеОДеятельностиВодителей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упРейс КАК упРейс
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упФактическиеПараметрыРейса КАК упФактическиеПараметрыРейса
	               |			ПО упРейс.Ссылка = упФактическиеПараметрыРейса.Рейс
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПлановыеПараметрыРейса КАК упПлановыеПараметрыРейса
	               |			ПО упРейс.Ссылка = упПлановыеПараметрыРейса.Рейс
	               |		ПО упТахографДанныеОДеятельностиВодителей.Рейс = упРейс.Ссылка
	               |ГДЕ
	               |	упТахографДанныеОДеятельностиВодителей.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И (НЕ &ИспользоватьОтборПоВодителю
	               |			ИЛИ упТахографДанныеОДеятельностиВодителей.Водитель = &Водитель)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период
	               |ИТОГИ
	               |	МИНИМУМ(Период),
	               |	МАКСИМУМ(ПериодОкончание)
	               |ПО
	               |	ОБЩИЕ,
	               |	Водитель";
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	Период.ДатаОкончания);
	
	ИспользоватьОтборПоВодителю = ЗначениеЗаполнено(Водитель);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоВодителю", 	ИспользоватьОтборПоВодителю);
	Запрос.УстановитьПараметр("Водитель", 						Водитель);
		
	дрвРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат дрвРезультат;
	
КонецФункции
 
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьШкалу(Форма, ВидШкалы)

	Диаграмма = Форма.Диаграмма;
	
	ШкалаВремениЭлементы = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы;
	
	ПервыйЭлементШкалы = ШкалаВремениЭлементы[0];
	Для Сч = -ШкалаВремениЭлементы.Количество()+1 по -1 Цикл
		ШкалаВремениЭлементы.Удалить(ШкалаВремениЭлементы[-Сч]);
	КонецЦикла;
	
	Форма.ВидШкалы = ВидШкалы;
	
	Если ВидШкалы = 0 Тогда
		// День, час
		ПервыйЭлементШкалы.Единица = ТипЕдиницыШкалыВремени.День;
		ПервыйЭлементШкалы.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
		ПервыйЭлементШкалы.ФорматДня =  ФорматДняШкалыВремени.ДеньМесяцаДеньНедели;
		
		ЭлементШкалы = ШкалаВремениЭлементы.Добавить();
		ЭлементШкалы.Единица = ТипЕдиницыШкалыВремени.Час;
		ЭлементШкалы.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Точечная, 1);
		
	ИначеЕсли ВидШкалы = 1 Тогда
		// Месяц, неделя, день
		ПервыйЭлементШкалы.Единица = ТипЕдиницыШкалыВремени.Месяц;
		ПервыйЭлементШкалы.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
		
		ЭлементШкалы = ШкалаВремениЭлементы.Добавить();
		ЭлементШкалы.Единица = ТипЕдиницыШкалыВремени.Неделя;
		ЭлементШкалы.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Точечная, 1);
		
		ЭлементШкалы = ШкалаВремениЭлементы.Добавить();
		ЭлементШкалы.Единица = ТипЕдиницыШкалыВремени.День;
		ЭлементШкалы.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Пунктир, 1);
		ЭлементШкалы.ФорматДня =  ФорматДняШкалыВремени.ДеньМесяца;
		
	Иначе
		
		ПервыйЭлементШкалы.Единица = ТипЕдиницыШкалыВремени.Год;
		ПервыйЭлементШкалы.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
		
		ЭлементШкалы = ШкалаВремениЭлементы.Добавить();
		ЭлементШкалы.Единица = ТипЕдиницыШкалыВремени.Месяц;
		ЭлементШкалы.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Точечная, 1);
		
	КонецЕсли; 
	
	ВыделитьТекущуюДату(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВыделитьТекущуюДату(Форма)

	Форма.Диаграмма.ИнтервалыФона.Очистить();
	
	ЦветТекущегоДня = WebЦвета.БледноЗеленый;
	
	Если Форма.ВидШкалы = 0 Тогда
		// День, час
		ИнтервалТекущегоДня = Форма.Диаграмма.ИнтервалыФона.Добавить(НачалоЧаса(ТекущаяДата()), КонецЧаса(ТекущаяДата()));
		ИнтервалТекущегоДня.Цвет = ЦветТекущегоДня;
	Иначе
		Если НачалоДня(Форма.Диаграмма.НачалоПолногоИнтервала) <> НачалоДня(Форма.Диаграмма.КонецПолногоИнтервала) Тогда
			ИнтервалТекущегоДня = Форма.Диаграмма.ИнтервалыФона.Добавить(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата()));
			ИнтервалТекущегоДня.Цвет = ЦветТекущегоДня;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДиаграммыПоУмолчанию(Диаграмма)

	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.ПоддержкаМасштаба               = ПоддержкаМасштабаДиаграммыГанта.Авто;
	Диаграмма.Окантовка                       = Истина;
	Диаграмма.Анимация                        = АнимацияДиаграммы.Использовать;
	Диаграмма.ВертикальнаяПрокрутка           = Истина;
	Диаграмма.ОтображатьПустыеЗначения        = Ложь;
	Диаграмма.ОтображатьЗаголовок             = Ложь;

КонецПроцедуры

#КонецОбласти
